#### Terraform Plan `success`

<details><summary>Show plan</summary>

```
data.cloudflare_zone.main: Reading...
google_project_service.artifactregistry: Refreshing state... [id=simonandrews-ca-terraform/artifactregistry.googleapis.com]
google_project_service.cloudresourcemanager: Refreshing state... [id=simonandrews-ca-terraform/cloudresourcemanager.googleapis.com]
google_project_service.run: Refreshing state... [id=simonandrews-ca-terraform/run.googleapis.com]
google_project_service.cloudbuild: Refreshing state... [id=simonandrews-ca-terraform/cloudbuild.googleapis.com]
google_project_service.iam: Refreshing state... [id=simonandrews-ca-terraform/iam.googleapis.com]
data.cloudflare_zone.main: Read complete after 1s [id=d6d3d7657a16a8f5650abce88f4ce603]
cloudflare_record.mx_1: Refreshing state... [id=4ab9a3ec39f3eca0eda1e948a417152b]
cloudflare_record.www: Refreshing state... [id=13a02ea8fb89f8355e74d788ee0b9940]
cloudflare_record.lhr2_wildcard: Refreshing state... [id=50ba09f7439412eb0659d61c35e1754d]
cloudflare_record.dkim_fm2: Refreshing state... [id=5f6bf537b0341ec95c5260ab2762cb58]
cloudflare_record.apex_a: Refreshing state... [id=c3c7d6f96a1b951584d5bb805ebc2b61]
cloudflare_record.dmarc: Refreshing state... [id=e4713053f2ebda61e3b1ccaea143cc77]
cloudflare_record.google_verification: Refreshing state... [id=5eb495f66f25e2a4e19412c33cf2b681]
cloudflare_record.lhr2_wildcard_aaaa: Refreshing state... [id=8c4c66126b29554ced869e83e7048bd4]
cloudflare_record.spf: Refreshing state... [id=021d305ece5fc6b062c83ad9c09ccd9c]
cloudflare_record.dkim_fm3: Refreshing state... [id=d9a71ded6306e51ffb11b80da0ecc8b5]
cloudflare_record.dkim_fm1: Refreshing state... [id=f448b309931fd44981db0dcff1736dad]
cloudflare_record.mx_2: Refreshing state... [id=fc8bb2e00bbea5c0af0a875026628683]
cloudflare_record.lhr2_aaaa: Refreshing state... [id=0dae59252d3a08acefd24564cc191349]
cloudflare_record.lhr2: Refreshing state... [id=b0b0e73af2b22612342b4658976a85b3]
google_service_account.terraform: Refreshing state... [id=projects/simonandrews-ca-terraform/serviceAccounts/terraform@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_iam_workload_identity_pool.github: Refreshing state... [id=projects/simonandrews-ca-terraform/locations/global/workloadIdentityPools/github-actions]
google_artifact_registry_repository.main: Refreshing state... [id=projects/simonandrews-ca-terraform/locations/europe-west1/repositories/simonandrews-ca]
google_service_account.cloud_build: Refreshing state... [id=projects/simonandrews-ca-terraform/serviceAccounts/simonandrews-ca-build@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_service_account.cloud_run: Refreshing state... [id=projects/simonandrews-ca-terraform/serviceAccounts/simonandrews-ca-run@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_project_iam_member.cloud_build_sa_user: Refreshing state... [id=simonandrews-ca-terraform/roles/iam.serviceAccountUser/serviceAccount:simonandrews-ca-build@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_cloudbuild_trigger.main: Refreshing state... [id=projects/simonandrews-ca-terraform/triggers/4efc2732-2d98-4855-9ba3-c34c87091264]
google_cloudbuild_trigger.preview: Refreshing state... [id=projects/simonandrews-ca-terraform/triggers/43fb9c95-9879-40fc-8df1-1f8ef0970203]
google_project_iam_member.cloud_build_run_admin: Refreshing state... [id=simonandrews-ca-terraform/roles/run.admin/serviceAccount:simonandrews-ca-build@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_project_iam_member.cloud_build_artifact_registry: Refreshing state... [id=simonandrews-ca-terraform/roles/artifactregistry.writer/serviceAccount:simonandrews-ca-build@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_project_iam_member.cloud_build_log_writer: Refreshing state... [id=simonandrews-ca-terraform/roles/logging.logWriter/serviceAccount:simonandrews-ca-build@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_iam_workload_identity_pool_provider.github: Refreshing state... [id=projects/simonandrews-ca-terraform/locations/global/workloadIdentityPools/github-actions/providers/github-actions]
google_cloud_run_v2_service.main: Refreshing state... [id=projects/simonandrews-ca-terraform/locations/europe-west1/services/simonandrews-ca]
google_service_account_iam_member.terraform_wif: Refreshing state... [id=projects/simonandrews-ca-terraform/serviceAccounts/terraform@simonandrews-ca-terraform.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/68732768207/locations/global/workloadIdentityPools/github-actions/attribute.repository/simon360/simonandrews.ca]
google_project_iam_member.terraform_sa["roles/storage.admin"]: Refreshing state... [id=simonandrews-ca-terraform/roles/storage.admin/serviceAccount:terraform@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_project_iam_member.terraform_sa["roles/artifactregistry.admin"]: Refreshing state... [id=simonandrews-ca-terraform/roles/artifactregistry.admin/serviceAccount:terraform@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_project_iam_member.terraform_sa["roles/iam.securityAdmin"]: Refreshing state... [id=simonandrews-ca-terraform/roles/iam.securityAdmin/serviceAccount:terraform@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_project_iam_member.terraform_sa["roles/iam.serviceAccountAdmin"]: Refreshing state... [id=simonandrews-ca-terraform/roles/iam.serviceAccountAdmin/serviceAccount:terraform@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_project_iam_member.terraform_sa["roles/iam.workloadIdentityPoolAdmin"]: Refreshing state... [id=simonandrews-ca-terraform/roles/iam.workloadIdentityPoolAdmin/serviceAccount:terraform@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_project_iam_member.terraform_sa["roles/run.admin"]: Refreshing state... [id=simonandrews-ca-terraform/roles/run.admin/serviceAccount:terraform@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_project_iam_member.terraform_sa["roles/iam.serviceAccountUser"]: Refreshing state... [id=simonandrews-ca-terraform/roles/iam.serviceAccountUser/serviceAccount:terraform@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_project_iam_member.terraform_sa["roles/cloudbuild.integrations.editor"]: Refreshing state... [id=simonandrews-ca-terraform/roles/cloudbuild.integrations.editor/serviceAccount:terraform@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_project_iam_member.terraform_sa["roles/cloudbuild.builds.editor"]: Refreshing state... [id=simonandrews-ca-terraform/roles/cloudbuild.builds.editor/serviceAccount:terraform@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_project_iam_member.terraform_sa["roles/serviceusage.serviceUsageAdmin"]: Refreshing state... [id=simonandrews-ca-terraform/roles/serviceusage.serviceUsageAdmin/serviceAccount:terraform@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_cloud_run_v2_service_iam_member.public: Refreshing state... [id=projects/simonandrews-ca-terraform/locations/europe-west1/services/simonandrews-ca/roles/run.invoker/allUsers]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # cloudflare_record.apex_a will be updated in-place
  ~ resource "cloudflare_record" "apex_a" {
      ~ content         = "76.76.21.21" -> (known after apply)
        id              = "c3c7d6f96a1b951584d5bb805ebc2b61"
        name            = "@"
      ~ proxied         = false -> true
        tags            = []
      ~ ttl             = 900 -> 1
        # (9 unchanged attributes hidden)
    }

  # cloudflare_record.www will be updated in-place
  ~ resource "cloudflare_record" "www" {
      ~ content         = "cname.vercel-dns.com" -> "simonandrews.ca"
        id              = "13a02ea8fb89f8355e74d788ee0b9940"
        name            = "www"
      ~ proxied         = false -> true
        tags            = []
      ~ ttl             = 900 -> 1
        # (9 unchanged attributes hidden)
    }

  # google_cloud_run_v2_service.main will be updated in-place
  ~ resource "google_cloud_run_v2_service" "main" {
        id                      = "projects/simonandrews-ca-terraform/locations/europe-west1/services/simonandrews-ca"
      ~ ingress                 = "INGRESS_TRAFFIC_ALL" -> "INGRESS_TRAFFIC_INTERNAL_LOAD_BALANCER"
        name                    = "simonandrews-ca"
        # (32 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # google_compute_backend_service.main will be created
  + resource "google_compute_backend_service" "main" {
      + connection_draining_timeout_sec = 300
      + creation_timestamp              = (known after apply)
      + fingerprint                     = (known after apply)
      + generated_id                    = (known after apply)
      + id                              = (known after apply)
      + load_balancing_scheme           = "EXTERNAL"
      + name                            = "simonandrews-ca-backend"
      + port_name                       = (known after apply)
      + project                         = "simonandrews-ca-terraform"
      + protocol                        = (known after apply)
      + self_link                       = (known after apply)
      + session_affinity                = (known after apply)
      + timeout_sec                     = (known after apply)

      + backend {
          + balancing_mode               = "UTILIZATION"
          + capacity_scaler              = 1
          + group                        = (known after apply)
          + max_connections              = (known after apply)
          + max_connections_per_endpoint = (known after apply)
          + max_connections_per_instance = (known after apply)
          + max_rate                     = (known after apply)
          + max_rate_per_endpoint        = (known after apply)
          + max_rate_per_instance        = (known after apply)
          + max_utilization              = (known after apply)
            # (2 unchanged attributes hidden)
        }

      + cdn_policy (known after apply)

      + iap (known after apply)

      + log_config (known after apply)
    }

  # google_compute_global_address.main will be created
  + resource "google_compute_global_address" "main" {
      + address            = (known after apply)
      + creation_timestamp = (known after apply)
      + effective_labels   = {
          + "goog-terraform-provisioned" = "true"
        }
      + id                 = (known after apply)
      + label_fingerprint  = (known after apply)
      + name               = "simonandrews-ca-ip"
      + prefix_length      = (known after apply)
      + project            = "simonandrews-ca-terraform"
      + self_link          = (known after apply)
      + terraform_labels   = {
          + "goog-terraform-provisioned" = "true"
        }
    }

  # google_compute_global_forwarding_rule.http will be created
  + resource "google_compute_global_forwarding_rule" "http" {
      + base_forwarding_rule  = (known after apply)
      + effective_labels      = (known after apply)
      + forwarding_rule_id    = (known after apply)
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + ip_protocol           = (known after apply)
      + label_fingerprint     = (known after apply)
      + load_balancing_scheme = "EXTERNAL"
      + name                  = "simonandrews-ca-http"
      + network               = (known after apply)
      + network_tier          = (known after apply)
      + port_range            = "80"
      + project               = "simonandrews-ca-terraform"
      + psc_connection_id     = (known after apply)
      + psc_connection_status = (known after apply)
      + self_link             = (known after apply)
      + subnetwork            = (known after apply)
      + target                = (known after apply)
      + terraform_labels      = (known after apply)

      + service_directory_registrations (known after apply)
    }

  # google_compute_global_forwarding_rule.https will be created
  + resource "google_compute_global_forwarding_rule" "https" {
      + base_forwarding_rule  = (known after apply)
      + effective_labels      = (known after apply)
      + forwarding_rule_id    = (known after apply)
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + ip_protocol           = (known after apply)
      + label_fingerprint     = (known after apply)
      + load_balancing_scheme = "EXTERNAL"
      + name                  = "simonandrews-ca-https"
      + network               = (known after apply)
      + network_tier          = (known after apply)
      + port_range            = "443"
      + project               = "simonandrews-ca-terraform"
      + psc_connection_id     = (known after apply)
      + psc_connection_status = (known after apply)
      + self_link             = (known after apply)
      + subnetwork            = (known after apply)
      + target                = (known after apply)
      + terraform_labels      = (known after apply)

      + service_directory_registrations (known after apply)
    }

  # google_compute_managed_ssl_certificate.main will be created
  + resource "google_compute_managed_ssl_certificate" "main" {
      + certificate_id            = (known after apply)
      + creation_timestamp        = (known after apply)
      + expire_time               = (known after apply)
      + id                        = (known after apply)
      + name                      = "simonandrews-ca-cert"
      + project                   = "simonandrews-ca-terraform"
      + self_link                 = (known after apply)
      + subject_alternative_names = (known after apply)
      + type                      = "MANAGED"

      + managed {
          + domains = [
              + "simonandrews.ca",
              + "www.simonandrews.ca",
            ]
        }
    }

  # google_compute_region_network_endpoint_group.cloud_run will be created
  + resource "google_compute_region_network_endpoint_group" "cloud_run" {
      + id                    = (known after apply)
      + name                  = "simonandrews-ca-neg"
      + network_endpoint_type = "SERVERLESS"
      + project               = "simonandrews-ca-terraform"
      + region                = "europe-west1"
      + self_link             = (known after apply)

      + cloud_run {
          + service = "simonandrews-ca"
        }

      + psc_data (known after apply)
    }

  # google_compute_target_http_proxy.main will be created
  + resource "google_compute_target_http_proxy" "main" {
      + creation_timestamp = (known after apply)
      + fingerprint        = (known after apply)
      + id                 = (known after apply)
      + name               = "simonandrews-ca-http-proxy"
      + project            = "simonandrews-ca-terraform"
      + proxy_bind         = (known after apply)
      + proxy_id           = (known after apply)
      + self_link          = (known after apply)
      + url_map            = (known after apply)
    }

  # google_compute_target_https_proxy.main will be created
  + resource "google_compute_target_https_proxy" "main" {
      + creation_timestamp = (known after apply)
      + fingerprint        = (known after apply)
      + id                 = (known after apply)
      + name               = "simonandrews-ca-https-proxy"
      + project            = "simonandrews-ca-terraform"
      + proxy_bind         = (known after apply)
      + proxy_id           = (known after apply)
      + quic_override      = "NONE"
      + self_link          = (known after apply)
      + ssl_certificates   = (known after apply)
      + tls_early_data     = (known after apply)
      + url_map            = (known after apply)
    }

  # google_compute_url_map.http_redirect will be created
  + resource "google_compute_url_map" "http_redirect" {
      + creation_timestamp = (known after apply)
      + fingerprint        = (known after apply)
      + id                 = (known after apply)
      + map_id             = (known after apply)
      + name               = "simonandrews-ca-http-redirect"
      + project            = "simonandrews-ca-terraform"
      + self_link          = (known after apply)

      + default_url_redirect {
          + https_redirect         = true
          + redirect_response_code = "MOVED_PERMANENTLY_DEFAULT"
          + strip_query            = false
        }
    }

  # google_compute_url_map.main will be created
  + resource "google_compute_url_map" "main" {
      + creation_timestamp = (known after apply)
      + default_service    = (known after apply)
      + fingerprint        = (known after apply)
      + id                 = (known after apply)
      + map_id             = (known after apply)
      + name               = "simonandrews-ca-url-map"
      + project            = "simonandrews-ca-terraform"
      + self_link          = (known after apply)
    }

  # google_project_iam_member.terraform_sa["roles/compute.admin"] will be created
  + resource "google_project_iam_member" "terraform_sa" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:terraform@simonandrews-ca-terraform.iam.gserviceaccount.com"
      + project = "simonandrews-ca-terraform"
      + role    = "roles/compute.admin"
    }

  # google_project_iam_member.terraform_sa["roles/compute.securityAdmin"] will be created
  + resource "google_project_iam_member" "terraform_sa" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:terraform@simonandrews-ca-terraform.iam.gserviceaccount.com"
      + project = "simonandrews-ca-terraform"
      + role    = "roles/compute.securityAdmin"
    }

  # google_project_service.compute will be created
  + resource "google_project_service" "compute" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "simonandrews-ca-terraform"
      + service            = "compute.googleapis.com"
    }

Plan: 13 to add, 3 to change, 0 to destroy.

Changes to Outputs:
  + load_balancer_ip             = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>